export const chats = [
  {
    id: '1A',
    title: 'Chat 1',
    icon: './images/logo_react.png',
    messages: [
      {
        id: '1A',
        authorId: '1A',
        date: '02/03/2020',
        time: '11:18',
        text: 'Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты.'
      },
      {
        id: '2B',
        authorId: '2B',
        date: '02/03/2020',
        time: '11:22',
        text: 'Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана.'
      },
      {
        id: '3C',
        authorId: '3C',
        date: '02/03/2020',
        time: '11:23',
        text: 'Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами.'
      },
      {
        id: '4D',
        authorId: '4D',
        date: '02/03/2020',
        time: '11:24',
        text: 'Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот.'
      },
      {
        id: '5E',
        authorId: '3C',
        date: '02/03/2020',
        time: '19:20',
        text: 'Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни.'
      },
      {
        id: '6F',
        authorId: '2B',
        date: '02/03/2020',
        time: '19:30',
        text: 'Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.'
      },
      {
        id: '7G',
        authorId: '1A',
        date: '28/03/2020',
        time: '09:31',
        text: 'Великий Оксмокс предупреждал ее о злых запятых, диких знаках вопроса и коварных точках с запятой, но текст не дал сбить себя с толку.'
      },
      {
        id: '8H',
        authorId: '1A',
        date: '28/03/2020',
        time: '09:41',
        text: 'Он собрал семь своих заглавных букв, подпоясал инициал за пояс и пустился в дорогу.'
      },
      {
        id: '9I',
        authorId: '2B',
        date: '28/03/2020',
        time: '09:51',
        text: 'Взобравшись на первую вершину курсивных гор, бросил он последний взгляд назад, на силуэт своего родного города Буквоград, на заголовок деревни Алфавит и на подзаголовок своего переулка Строчка.'
      },
      {
        id: '10J',
        authorId: '3C',
        date: '28/03/2020',
        time: '11:24',
        text: 'Грустный реторический вопрос скатился по его щеке и он продолжил свой путь.'
      },
      {
        id: '11K',
        authorId: '3C',
        date: '28/03/2020',
        time: '19:20',
        text: 'По дороге встретил текст рукопись.'
      },
      {
        id: '12L',
        authorId: '1A',
        date: '28/03/2020',
        time: '19:30',
        text: 'Она предупредила его: «В моей стране все переписывается по несколько раз. Единственное, что от меня осталось, это приставка «и». Возвращайся ты лучше в свою безопасную страну».'
      }
    ],
    lastDate: '',
    lastAuthor: '',
    lastMessage: ''
  },
  {
    id: '2B',
    title: 'Chat 2',
    icon: './images/logo_super.png',
    messages: [
      {
        id: '1A',
        authorId: '2B',
        date: '15/03/2020',
        time: '11:18',
        text: 'Не послушавшись рукописи, наш текст продолжил свой путь.'
      },
      {
        id: '2B',
        authorId: '3C',
        date: '15/03/2020',
        time: '11:22',
        text: 'Вскоре ему повстречался коварный составитель рекламных текстов, напоивший его языком и речью и заманивший в свое агенство, которое использовало его снова и снова в своих проектах.'
      },
      {
        id: '3C',
        authorId: '3C',
        date: '15/03/2020',
        time: '11:23',
        text: 'Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты.'
      },
      {
        id: '4D',
        authorId: '4D',
        date: '15/03/2020',
        time: '11:24',
        text: 'Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.'
      },
      {
        id: '5E',
        authorId: '1A',
        date: '15/03/2020',
        time: '19:20',
        text: 'Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни.'
      },
      {
        id: '6F',
        authorId: '2B',
        date: '15/03/2020',
        time: '19:30',
        text: 'Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.'
      },
      {
        id: '7G',
        authorId: '2B',
        date: '16/03/2020',
        time: '09:31',
        text: 'Lorem Ipsum - это текст-"рыба", часто используемый в печати и веб-дизайне.'
      },
      {
        id: '8H',
        authorId: '2B',
        date: '16/03/2020',
        time: '09:41',
        text: 'Lorem Ipsum является стандартной "рыбой" для текстов на латинице с начала XVI века.'
      },
      {
        id: '9I',
        authorId: '3C',
        date: '16/03/2020',
        time: '09:51',
        text: 'В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов.'
      },
      {
        id: '10J',
        authorId: '3C',
        date: '16/03/2020',
        time: '11:24',
        text: 'Lorem Ipsum не только успешно пережил без заметных изменений пять веков, но и перешагнул в электронный дизайн.'
      },
      {
        id: '11K',
        authorId: '4D',
        date: '16/03/2020',
        time: '19:20',
        text: 'Его популяризации в новое время послужили публикация листов Letraset с образцами Lorem Ipsum в 60-х годах'
      },
      {
        id: '12L',
        authorId: '4D',
        date: '16/03/2020',
        time: '19:30',
        text: 'и в более недавнее время, программы электронной вёрстки типа Aldus PageMaker, в шаблонах которых используется Lorem Ipsum.'
      }
    ],
    lastDate: '',
    lastAuthor: '',
    lastMessage: ''
  },
  {
    id: '3C',
    title: 'Chat 3',
    icon: './images/logo_react.png',
    messages: [
      {
        id: '1A',
        authorId: '1A',
        date: '18/11/2019',
        time: '11:18',
        text: 'Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так.'
      },
      {
        id: '2B',
        authorId: '3C',
        date: '18/11/2019',
        time: '11:22',
        text: 'Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетий назад.'
      },
      {
        id: '3C',
        authorId: '2B',
        date: '18/11/2019',
        time: '11:23',
        text: 'Ричард МакКлинток, профессор латыни из колледжа Hampden-Sydney, штат Вирджиния, взял одно из самых странных слов в Lorem Ipsum, "consectetur", и занялся его поисками в классической латинской литературе. '
      },
      {
        id: '4D',
        authorId: '4D',
        date: '18/11/2019',
        time: '11:24',
        text: 'В результате он нашёл неоспоримый первоисточник Lorem Ipsum в разделах 1.10.32 и 1.10.33 книги "de Finibus Bonorum et Malorum" ("О пределах добра и зла"), написанной Цицероном в 45 году н.э.'
      },
      {
        id: '5E',
        authorId: '3C',
        date: '18/11/2019',
        time: '19:20',
        text: 'Этот трактат по теории этики был очень популярен в эпоху Возрождения.'
      },
      {
        id: '6F',
        authorId: '4D',
        date: '18/11/2019',
        time: '19:30',
        text: 'Первая строка Lorem Ipsum, "Lorem ipsum dolor sit amet..", происходит от одной из строк в разделе 1.10.32'
      },
      {
        id: '7G',
        authorId: '2B',
        date: '23/12/2019',
        time: '09:31',
        text: 'Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться.'
      },
      {
        id: '8H',
        authorId: '1A',
        date: '23/12/2019',
        time: '09:41',
        text: 'Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также ...'
      },
      {
        id: '9I',
        authorId: '2B',
        date: '23/12/2019',
        time: '09:51',
        text: '... реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации "Здесь ваш текст... Здесь ваш текст... Здесь ваш текст..."'
      },
      {
        id: '10G',
        authorId: '3C',
        date: '23/12/2019',
        time: '11:24',
        text: 'Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию, так что...'
      },
      {
        id: '11K',
        authorId: '4D',
        date: '23/12/2019',
        time: '19:20',
        text: '... поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц всё ещё дожидаются своего настоящего рождения.'
      },
      {
        id: '12L',
        authorId: '4D',
        date: '23/12/2019',
        time: '19:30',
        text: 'За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно (например, юмористические варианты).'
      }
    ],
    lastDate: '',
    lastAuthor: '',
    lastMessage: ''
  },
  {
    id: '4D',
    title: 'Chat 4',
    icon: './images/logo_super.png',
    messages: [
      {
        id: '1A',
        authorId: '2B',
        date: '15/03/2020',
        time: '11:18',
        text: 'Не послушавшись рукописи, наш текст продолжил свой путь.'
      },
      {
        id: '2B',
        authorId: '1A',
        date: '15/03/2020',
        time: '11:22',
        text: 'Вскоре ему повстречался коварный составитель рекламных текстов, напоивший его языком и речью и заманивший в свое агенство, которое использовало его снова и снова в своих проектах.'
      },
      {
        id: '3C',
        authorId: '3C',
        date: '15/03/2020',
        time: '11:23',
        text: 'Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты.'
      },
      {
        id: '4D',
        authorId: '4D',
        date: '15/03/2020',
        time: '11:24',
        text: 'Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.'
      },
      {
        id: '5E',
        authorId: '1A',
        date: '15/03/2020',
        time: '19:20',
        text: 'Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни.'
      },
      {
        id: '6F',
        authorId: '4D',
        date: '15/03/2020',
        time: '19:30',
        text: 'Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.'
      },
      {
        id: '7G',
        authorId: '1A',
        date: '16/03/2020',
        time: '09:31',
        text: 'Lorem Ipsum - это текст-"рыба", часто используемый в печати и веб-дизайне.'
      },
      {
        id: '8H',
        authorId: '2B',
        date: '16/03/2020',
        time: '09:41',
        text: 'Lorem Ipsum является стандартной "рыбой" для текстов на латинице с начала XVI века.'
      },
      {
        id: '9I',
        authorId: '3C',
        date: '16/03/2020',
        time: '09:51',
        text: 'В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов.'
      },
      {
        id: '10J',
        authorId: '3C',
        date: '16/03/2020',
        time: '11:24',
        text: 'Lorem Ipsum не только успешно пережил без заметных изменений пять веков, но и перешагнул в электронный дизайн.'
      },
      {
        id: '11K',
        authorId: '1A',
        date: '16/03/2020',
        time: '19:20',
        text: 'Его популяризации в новое время послужили публикация листов Letraset с образцами Lorem Ipsum в 60-х годах'
      },
      {
        id: '12L',
        authorId: '3C',
        date: '16/03/2020',
        time: '19:30',
        text: 'и в более недавнее время, программы электронной вёрстки типа Aldus PageMaker, в шаблонах которых используется Lorem Ipsum.'
      }
    ],
    lastDate: '',
    lastAuthor: '',
    lastMessage: ''
  },
  {
    id: '5E',
    title: 'Chat 5',
    icon: './images/logo_react.png',
    messages: [
      {
        id: '1A',
        authorId: '1A',
        date: '30/04/2020',
        time: '08:36',
        text: 'Ну че пацаны го шашлыки на майские'
      },
      {
        id: '2B',
        authorId: '4D',
        date: '30/04/2020',
        time: '08:44',
        text: 'Но ведь сейчас же эпидемия и лучше сидеть дома'
      },
      {
        id: '3C',
        authorId: '3C',
        date: '30/04/2020',
        time: '08:50',
        text: 'Ты че деб, а как же мясо и певко'
      },
      {
        id: '4D',
        authorId: '2B',
        date: '30/04/2020',
        time: '08:55',
        text: 'Никакой эпидемии нет, просто микромягкие Врата Билла хотят чипировать и убить всех людей с помощью 5G'
      },
      {
        id: '5E',
        authorId: '3C',
        date: '30/04/2020',
        time: '09:01',
        text: 'На самом деле это все рептилоиды и пришельцы'
      },
      {
        id: '6F',
        authorId: '1A',
        date: '30/04/2020',
        time: '10:10',
        text: 'так че на счет шашлыков и пивандоса, господа??????????????'
      },
      {
        id: '7G',
        authorId: '2B',
        date: '08/05/2020',
        time: '09:31',
        text: 'Не лучшая была идея'
      },
      {
        id: '8H',
        authorId: '3C',
        date: '08/05/2020',
        time: '09:35',
        text: 'Да, думаю не стоило'
      },
      {
        id: '9I',
        authorId: '3C',
        date: '08/05/2020',
        time: '09:45',
        text: 'Жаль Леху, хороший парень был'
      },
      {
        id: '10J',
        authorId: '2B',
        date: '08/05/2020',
        time: '11:24',
        text: 'Давайте после праздников навестим его в больнице'
      },
      {
        id: '11K',
        authorId: '4D',
        date: '08/05/2020',
        time: '15:16',
        text: 'Пацаны я тоже проверился, у меня положительный, ложусь лечиться в больничку, пока не дошло до ситуации Лехи советую вам также поступить'
      },
      {
        id: '12L',
        authorId: '2B',
        date: '08/05/2020',
        time: '16:15',
        text: 'Кажется тот поход на шашлыки того не стоял(((((((((('
      }
    ],
    lastDate: '',
    lastAuthor: '',
    lastMessage: ''
  },
  {
    id: '6F',
    title: 'Chat 6',
    icon: './images/logo_super.png',
    messages: [
      {
        id: '1A',
        authorId: '1A',
        date: '02/03/2020',
        time: '11:18',
        text: 'Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты.'
      },
      {
        id: '2B',
        authorId: '2B',
        date: '02/03/2020',
        time: '11:22',
        text: 'Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана.'
      },
      {
        id: '3C',
        authorId: '3C',
        date: '02/03/2020',
        time: '11:23',
        text: 'Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами.'
      },
      {
        id: '4D',
        authorId: '4D',
        date: '02/03/2020',
        time: '11:24',
        text: 'Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот.'
      },
      {
        id: '5E',
        authorId: '3C',
        date: '02/03/2020',
        time: '19:20',
        text: 'Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни.'
      },
      {
        id: '6F',
        authorId: '2B',
        date: '02/03/2020',
        time: '19:30',
        text: 'Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.'
      },
      {
        id: '7G',
        authorId: '1A',
        date: '28/03/2020',
        time: '09:31',
        text: 'Великий Оксмокс предупреждал ее о злых запятых, диких знаках вопроса и коварных точках с запятой, но текст не дал сбить себя с толку.'
      },
      {
        id: '8H',
        authorId: '1A',
        date: '28/03/2020',
        time: '09:41',
        text: 'Он собрал семь своих заглавных букв, подпоясал инициал за пояс и пустился в дорогу.'
      },
      {
        id: '9I',
        authorId: '2B',
        date: '28/03/2020',
        time: '09:51',
        text: 'Взобравшись на первую вершину курсивных гор, бросил он последний взгляд назад, на силуэт своего родного города Буквоград, на заголовок деревни Алфавит и на подзаголовок своего переулка Строчка.'
      },
      {
        id: '10J',
        authorId: '3C',
        date: '28/03/2020',
        time: '11:24',
        text: 'Грустный реторический вопрос скатился по его щеке и он продолжил свой путь.'
      },
      {
        id: '11K',
        authorId: '3C',
        date: '28/03/2020',
        time: '19:20',
        text: 'По дороге встретил текст рукопись.'
      },
      {
        id: '12L',
        authorId: '1A',
        date: '28/03/2020',
        time: '19:30',
        text: 'Она предупредила его: «В моей стране все переписывается по несколько раз. Единственное, что от меня осталось, это приставка «и». Возвращайся ты лучше в свою безопасную страну».'
      }
    ],
    lastDate: '',
    lastAuthor: '',
    lastMessage: ''
  },
];

export const users = [
  { 
    id: '1A',
    name: 'Леха',
    image: './images/lexa.png'
  },
  { 
    id: '2B',
    name: 'Мистер Шрек',
    image: './images/shrek.jpg'
  },
  {
    id: '3C',
    name: 'Lorem ipsum',
    image: './images/lorem_ipsum.png'
  },
  {
    id: '4D',
    name: 'Адеватный человек',
    image: './images/four.jpg'
  }
];